In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('Udemy.csv')

In [3]:
df.head()

,Name,Title,Status
0,Abdutayyeb Rampurawala,[NEW] Ultimate AWS Certified Cloud Practitione...,45
1,NaN,Analytics Engineering Bootcamp,100
2,NaN,Apache Kafka Series - Learn Apache Kafka for B...,35
3,NaN,Automate the Boring Stuff with Python Programming,100
4,NaN,AWS Amazon S3 Mastery Bootcamp,100

In [4]:
df.tail()

,Name,Title,Status
1679,NaN,The Python Bible™ | Everything You Need to Pro...,100
1680,NaN,The Ultimate Hands-On Hadoop: Tame your Big Data!,100
1681,NaN,Using MySQL Databases With Python,100
1682,Vinod R C Total,NaN,4447
1683,Grand Total,NaN,130031

In [8]:
total_rows = df[df['Name'].str.contains('total', case=False)]

In [7]:
df['Name'].fillna('', inplace=True)

In [9]:
print(total_rows)

                               Name Title  Status
62     Abdutayyeb Rampurawala Total   NaN    4937
126            Abhishek Kumar Total   NaN    5242
180       Adishree Solapurkar Total   NaN    4763
242        Anand Kumar Sharma Total   NaN    5432
285            Aryaman Mishra Total   NaN    2934
326              Atharv Tathe Total   NaN    3459
406         Chadaram Padmakar Total   NaN    5261
456            Chetan Sheoran Total   NaN    3455
522   Chinmay Harshad Vyapari Total   NaN    5217
580      Dharshan N Renukesha Total   NaN    4830
641              Grishma Raja Total   NaN    5168
699     Haneefa Tasneem Shaik Total   NaN    4809
758        Hetu Prakash Patel Total   NaN    5476
813            Jaspreet Pannu Total   NaN    4766
893               Kunal Singh Total   NaN    5259
955              Mahan Khanal Total   NaN    5403
1021          Manav Choudhary Total   NaN    4966
1080            Medini G Bhat Total   NaN    5499
1144            Mohini Shinde Total   NaN    5596
1202           Prasad Gaikwad Total   NaN    4957
1278       Prashant Kumar Roy Total   NaN    3298
1338          Prashant Pathak Total   NaN    4982
1403    Shahid Mansoor Shaikh Total   NaN    4677
1452              Shubham Raj Total   NaN     509
1510            Siddharth Das Total   NaN    4251
1568              Smita Gupta Total   NaN    5449
1627         Vamsi Kandimalla Total   NaN    4989
1682                Vinod R C Total   NaN    4447
1683                    Grand Total   NaN  130031

In [12]:
sorted_df = total_rows.sort_values(by='Status')

In [13]:
print(sorted_df)

                               Name Title  Status
1452              Shubham Raj Total   NaN     509
285            Aryaman Mishra Total   NaN    2934
1278       Prashant Kumar Roy Total   NaN    3298
456            Chetan Sheoran Total   NaN    3455
326              Atharv Tathe Total   NaN    3459
1510            Siddharth Das Total   NaN    4251
1682                Vinod R C Total   NaN    4447
1403    Shahid Mansoor Shaikh Total   NaN    4677
180       Adishree Solapurkar Total   NaN    4763
813            Jaspreet Pannu Total   NaN    4766
699     Haneefa Tasneem Shaik Total   NaN    4809
580      Dharshan N Renukesha Total   NaN    4830
62     Abdutayyeb Rampurawala Total   NaN    4937
1202           Prasad Gaikwad Total   NaN    4957
1021          Manav Choudhary Total   NaN    4966
1338          Prashant Pathak Total   NaN    4982
1627         Vamsi Kandimalla Total   NaN    4989
641              Grishma Raja Total   NaN    5168
522   Chinmay Harshad Vyapari Total   NaN    5217
126            Abhishek Kumar Total   NaN    5242
893               Kunal Singh Total   NaN    5259
406         Chadaram Padmakar Total   NaN    5261
955              Mahan Khanal Total   NaN    5403
242        Anand Kumar Sharma Total   NaN    5432
1568              Smita Gupta Total   NaN    5449
758        Hetu Prakash Patel Total   NaN    5476
1080            Medini G Bhat Total   NaN    5499
1144            Mohini Shinde Total   NaN    5596
1683                    Grand Total   NaN  130031

In [14]:
sorted_df.shape

(29, 3)

In [15]:
sorted_df.to_csv('sorted_df.csv', index=False)

In [16]:
sorted_df.shape

(29, 3)

In [17]:
dates = pd.date_range("20130101", periods=6)

In [18]:
print(dates)

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')